<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of nextSPOT Download Manager and creates a package.

NOTE: The app from the vendor is NOT code signed.

NOTE: The app installs a Launch Agent for the user when first launched.</string>
	<key>Identifier</key>
	<string>com.github.brianwells.pkg.nextSPOT</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>nextSPOT</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.brianwells.download.nextSPOT</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
						<key>Applications</key>
						<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkg/root</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%/nextSPOTDownloadInstaller_x64.mpkg/Contents/Packages/nextspotdownloadx64.pkg</string>
				<key>extract_root</key>
				<string>%RECIPE_CACHE_DIR%/extracted</string>
			</dict>
			<key>Processor</key>
			<string>PkgExtractor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
					<key>info_path</key>
					<string>%RECIPE_CACHE_DIR%/extracted/Applications/nextSPOTDownload_x64.app/Contents/Info.plist</string>
					<key>plist_keys</key>
					<dict>
							<key>CFBundleShortVersionString</key>
							<string>version</string>
							<key>CFBundleIdentifier</key>
							<string>bundleid</string>
					</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg/root/Applications/nextSPOTDownload_x64.app</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/extracted/Applications/nextSPOTDownload_x64.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>id</key>
					<string>%bundleid%</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%/</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkg/root</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%version%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/extracted</string>
					<string>%RECIPE_CACHE_DIR%/pkg</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
