<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of nextSPOT Download Manager and imports it into Munki.

NOTE: The app from the vendor is NOT code signed.

NOTE: The app installs a Launch Agent for the user when first launched.</string>
	<key>Identifier</key>
	<string>com.github.brianwells.munki.nextSPOT</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/FotoKem</string>
		<key>NAME</key>
		<string>nextSPOT</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Download manager for the FotoKem nextSPOT service.</string>
			<key>developer</key>
			<string>Foto-Kem Industries, Inc.</string>
			<key>display_name</key>
			<string>FotoKem nextSPOT Download Manager</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.brianwells.pkg.nextSPOT</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
