<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of nextSPOT Download Manager.</string>
	<key>Identifier</key>
	<string>com.github.brianwells.download.nextSPOT</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>nextSPOT</string>
		<key>url</key>
		<string>https://nsprodstr01.blob.core.windows.net/gdinstallers/nextSPOTDownload_x64.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
